[
    {
        "type": "message",
        "user": "U3TP1UC1X",
        "text": "does everyone know how to clone the github repo? There have only been 3 ppl that have cloned it",
        "ts": "1486050196.000002"
    },
    {
        "type": "message",
        "user": "U3TP1UC1X",
        "text": "If u need help I can walk you through it",
        "ts": "1486050209.000003"
    },
    {
        "type": "message",
        "user": "U3TP1UC1X",
        "text": "oh also, Im going to export the conversation tonight and add it to the github. So if there is anything you want to talk about or add in chat go for it!",
        "ts": "1486052496.000004"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Maybe we can do a login for the teacher, where he can input from there how many students are present in his class, and that way we can get stats on what percentage of the class actually participated",
        "ts": "1486068254.000002"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Im guessing that would require a server but knowing how many students didnt participate is kind a important, what you think?",
        "ts": "1486068322.000003"
    },
    {
        "type": "message",
        "user": "U3TP1UC1X",
        "text": "Yeah we will have to do some server implementation if we want to do that. I'll look into it",
        "ts": "1486069131.000004"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "Aight, so to resolve the issue of the user stories, I was about to \"modify\" them to this: \n\nAs a student, I want to...\n\n1. be able to respond to the teacher's questions anonymously so that I can answer without fearing the judgement of my peers\n\n2. receive feedback on the accuracy of my answers from my teacher so I dont have to wait for quiz to test my understanding of the subject\n\n3. Be able to change my answer so that my answer can elvove with my understanding of the question\n\n4. Be able to show that I am attending the class so that the Teacher can accuratly know if I was present or not\n\nAs a teacher, I want to...\n\n1. be able to ask question about the lecture topics, so that I can test the understanding of my students of the lecture's material\n\n2. take attendance of my classes so I can accuratly see how many people show up to class\n\n3. see the number of students that chose each option so I can see which percentage of the class understand the topics, and where does people make mistakes\n\n4. [that] each of my student to answer the question only once, so that I can have accurate results in the analytics of the questions\n\n5. I want to be able to implement a time limit so that I can control the amount of time spent on each question",
        "ts": "1486074106.000005"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "is everubpdy okay with this",
        "ts": "1486074112.000006"
    },
    {
        "type": "message",
        "user": "U3TP1UC1X",
        "text": "Looks good push it to your branch",
        "ts": "1486074916.000007"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Yeah it looks great! \nHow about this:\nAs a teacher, I want to be able to see how many present students are not answering the questions ?",
        "ts": "1486076059.000008"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "yeah its dank",
        "ts": "1486076085.000009"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Lool",
        "ts": "1486076207.000010"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Should we meet tomorrow before the tutorial to meet the 2 new guys and see what we will say during the tutorial?",
        "ts": "1486076233.000011"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "we could",
        "ts": "1486077748.000012"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "do you have their emails",
        "ts": "1486077763.000013"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "so we can add them on the slack channel?",
        "ts": "1486077768.000014"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "Umm no but they sent me a message through moodle, did you get that as well?",
        "ts": "1486079107.000015"
    },
    {
        "type": "message",
        "user": "U3XK3T0P6",
        "text": "One from kuan jiang, the other from mounir maarabani",
        "ts": "1486079140.000016"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "I pushed it to the master",
        "ts": "1486092662.000017"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "I'll answer them and ask them for their emails",
        "ts": "1486092678.000018"
    },
    {
        "type": "message",
        "user": "U3U0P9VT2",
        "text": "Any answer from 2 new members? I did send then all the necessary information through moodle today. No response so far.",
        "ts": "1486097018.000019"
    },
    {
        "type": "message",
        "user": "U3X0369CN",
        "text": "none either",
        "ts": "1486097868.000020"
    }
]